In [12]:
import pandas as pd
from IPython.display import display

# Caminho do arquivo
ibovespa_file = 'camada_bronze\\Ibovespa_Evolucao_Anual_2010_2024.xlsx'

# Carregar o arquivo
ibovespa_df = pd.read_excel(ibovespa_file)

# Exibir o DataFrame
display(ibovespa_df)

,Dia,Jan,Fev,Mar,Abr,Mai,Jun,Jul,Ago,Set,Out,Nov,Dez,Ano
0,1,NaN,66571.74,67227.93,71136.34,NaN,61840.99,61236.20,NaN,67072.53,70229.35,71560.93,69345.85,2010
1,2,NaN,67163.21,67779.16,NaN,NaN,62942.91,61429.79,68517.46,66808.08,NaN,NaN,69527.07,2010
2,3,NaN,67108.56,67641.34,NaN,67119.41,NaN,NaN,67997.36,66678.62,NaN,71904.77,69766.09,2010
3,4,70045.08,63934.01,67814.71,NaN,64869.32,61675.75,NaN,68272.00,NaN,70384.92,72995.69,NaN,2010
4,5,70239.82,62762.70,68846.50,71289.68,64914.17,NaN,60865.27,68411.72,NaN,71283.11,72606.58,NaN,2010
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
460,27,NaN,131689.37,127690.62,NaN,124495.68,124307.83,NaN,136775.91,132730.36,NaN,127668.61,120269.31,2024
461,28,NaN,130155.43,128106.10,NaN,123779.54,123906.55,NaN,137343.96,NaN,131212.58,124610.41,NaN,2024
462,29,128502.66,129020.02,NaN,127351.79,122707.28,NaN,126953.86,136041.35,NaN,130729.93,125667.83,NaN,2024
463,30,127401.81,NaN,NaN,125924.19,NaN,NaN,126139.21,136004.01,131816.44,130639.33,NaN,120283.40,2024
464,31,127752.28,NaN,NaN,NaN,122098.09,NaN,127651.81,NaN,NaN,129713.33,NaN,NaN,2024

In [ ]:
import pandas as pd

# Inicializar uma lista para armazenar os dados transformados
transformed_data = []

# Iterar sobre os anos
for year in range(2010, 2025):
    # Filtrando os dados do ano atual
    year_data = ibovespa_df[ibovespa_df['Ano'] == year]
    
    # Iterar sobre os dias 
    for day in range(1, 32):
        # Iterar sobre os meses (Janeiro - Dezembro)
        for month_index in range(1, 13): 
            # Verificar se existe dado para esse dia específico no mês e ano
            value = year_data.iloc[day - 1, month_index]

            # Se existir um valor para esse dia
            if pd.notna(value):
                # Criar a data completa (dia/mês/ano)
                date = f'{day:02d}-{month_index:02d}-{year}'

                # Adicionar os dados transformados à lista
                transformed_data.append({
                    'Dia': day,
                    'Mês': pd.to_datetime(f'{month_index}-01', format='%m-%d').strftime('%B'),  # Nome do mês em inglês
                    'Ano': year,
                    'Data': date,
                    'Valor': value
                })

transformed_df = pd.DataFrame(transformed_data)

# Reorganizar as colunas
transformed_df = transformed_df[['Data', 'Dia', 'Mês', 'Ano', 'Valor']]

# Exibir o DataFrame
display(transformed_df)

            Data  Dia       Mês   Ano      Valor
0     01-02-2010    1  February  2010   66571.74
1     01-03-2010    1     March  2010   67227.93
2     01-04-2010    1     April  2010   71136.34
3     01-06-2010    1      June  2010   61840.99
4     01-07-2010    1      July  2010   61236.20
...          ...  ...       ...   ...        ...
3712  30-12-2024   30  December  2024  120283.40
3713  31-01-2024   31   January  2024  127752.28
3714  31-05-2024   31       May  2024  122098.09
3715  31-07-2024   31      July  2024  127651.81
3716  31-10-2024   31   October  2024  129713.33

[3717 rows x 5 columns]

In [14]:
#Verificando se há valores nulos
transformed_df.isna().sum()

Data     0
Dia      0
Mês      0
Ano      0
Valor    0
dtype: int64

In [15]:
#Identificando os tipos de cada coluna
transformed_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3717 entries, 0 to 3716
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    3717 non-null   object
 1   Dia     3717 non-null   int64
 2   Mês     3717 non-null   object
 3   Ano     3717 non-null   int64
 4   Valor   3717 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 145.3+ KB

In [16]:
# Exportar o DataFrame para um arquivo Excel
transformed_df.to_excel('camada_prata/ibovespa_clean.xlsx', index=False)